app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "c@gmail.com"], ["LIMIT", 1]]
---
	def create
		#complete this method
		user = User.where(email: session_params[:email]).first